tap "probe-rs/probe-rs"

brew "bat"
brew "bottom"
brew "cmake"
brew "curl"
brew "deno"
brew "dust"
brew "fastfetch"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "go"
brew "grpcurl"
brew "jq"
brew "llvm"
brew "lsd"
brew "mise"
brew "mold"
brew "neovim"
brew "nyancat"
brew "openocd"
brew "openssh"
brew "probe-rs"
brew "protobuf"
brew "python"
brew "rustup"
brew "sbt"
brew "sheldon"
brew "starship"
brew "tmux"
brew "uv"
brew "wget"
brew "zoxide"
brew "zsh"

cask "discord"
cask "docker"
cask "font-firgenerd"
cask "gcc-arm-embedded"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "keycastr"
cask "obsidian"
cask "raspberry-pi-imager"
cask "raycast"
cask "slack"
cask "visual-studio-code"
cask "vivaldi"
cask "wezterm"
cask "xquartz"
cask "zed"
cask "zoom"
