tap "homebrew/bundle"

brew "bat"
brew "curl"
brew "dust"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "jq"
brew "lazygit"
brew "llvm"
brew "lsd"
brew "mise"
brew "neovim"
brew "openssh"
brew "protobuf"
brew "rustup-init"
brew "sheldon"
brew "starship"
brew "tmux"
brew "wget"
brew "zoxide"
brew "zsh"

cask "discord"
cask "docker"
cask "font-firgenerd"
cask "karabiner-elements"
cask "keycastr"
cask "obsidian"
cask "raspberry-pi-imager"
cask "raycast"
cask "slack"
cask "visual-studio-code"
cask "wezterm"
cask "xquartz"
cask "zoom"
cask "zulip"
